# language:ru
# encoding: utf-8
Функционал: Животные и растения -> Животные -> Кошки - seo-линки

  Контекст:
    Когда открыта страница для региона "Россия"
        * на главной странице я перехожу в категорию "Животные и растения -> Животные -> Кошки"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр
    Когда я выбираю ссылку "Абиссинская" в секции "Быстрый поиск"
       То ссылка содержит "abyssinian"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value       |
          | Абиссинская |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Ангорская" в секции "Быстрый поиск"
       То ссылка содержит "angora"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value     |
          | Ангорская |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бенгальская" в секции "Быстрый поиск"
       То ссылка содержит "bengali"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value       |
          | Бенгальская |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бирманская" в секции "Быстрый поиск"
       То ссылка содержит "burmese"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Бирманская |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Британская короткошерстная" в секции "Быстрый поиск"
       То ссылка содержит "british-shorthair"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value                      |
          | Британская короткошерстная |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бурманская короткошерстная" в секции "Быстрый поиск"
       То ссылка содержит "burmanskaya-shorthair"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value                      |
          | Бурманская короткошерстная |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Девон-рекс" в секции "Быстрый поиск"
       То ссылка содержит "devon-rex"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Девон-рекс |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Донской сфинкс" в секции "Быстрый поиск"
       То ссылка содержит "don-sphynx"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value          |
          | Донской сфинкс |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Донской сфинкс" в секции "Быстрый поиск"
       То ссылка содержит "don-sphynx"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value          |
          | Донской сфинкс |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Канадский сфинкс" в секции "Быстрый поиск"
       То ссылка содержит "canadian-sphynx"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value            |
          | Канадский сфинкс |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Корниш-рекс" в секции "Быстрый поиск"
       То ссылка содержит "cornish-rex"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value       |
          | Корниш-рекс |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Курильский бобтейл" в секции "Быстрый поиск"
       То ссылка содержит "kurilian-bobtail"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value              |
          | Курильский бобтейл |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Манчкин" в секции "Быстрый поиск"
       То ссылка содержит "manchkin"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value   |
          | Манчкин |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Мейн кун" в секции "Быстрый поиск"
       То ссылка содержит "maine-kunas"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value    |
          | Мейн кун |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Невская маскарадная кошка" в секции "Быстрый поиск"
       То ссылка содержит "neva-masquerade"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value                     |
          | Невская маскарадная кошка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Норвежская лесная кошка" в секции "Быстрый поиск"
       То ссылка содержит "norwegian-forest"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value                   |
          | Норвежская лесная кошка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Ориентальная" в секции "Быстрый поиск"
       То ссылка содержит "oriental"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value        |
          | Ориентальная |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Персидская" в секции "Быстрый поиск"
       То ссылка содержит "persian"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Персидская |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Петербургский сфинкс" в секции "Быстрый поиск"
       То ссылка содержит "petersburg-sphinx"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value                |
          | Петербургский сфинкс |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Селкирк-рекс" в секции "Быстрый поиск"
       То ссылка содержит "selkirk-rex"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value        |
          | Селкирк-рекс |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Сиамская" в секции "Быстрый поиск"
       То ссылка содержит "siamese"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value    |
          | Сиамская |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Шотландская вислоухая" в секции "Быстрый поиск"
       То ссылка содержит "scottish-lop-eared"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value                 |
          | Шотландская вислоухая |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Экзотическая короткошерстная" в секции "Быстрый поиск"
       То ссылка содержит "exotic-short-cat"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value                        |
          | Экзотическая короткошерстная |
