# language:ru
# encoding: utf-8
Функционал: Животные и растения -> Животные -> Собаки - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Животные и растения -> Животные -> Собаки"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по английским бульдогам
    Когда я выбираю ссылку "Английский бульдог" в секции "Быстрый поиск"
       То ссылка содержит "english-bulldog"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value              |
          | Английский бульдог |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Американский бульдог" в секции "Быстрый поиск"
       То ссылка содержит "american-bulldog"
        * в поле "Порода" выбраны следующие значения:
          | value                |
          | Американский бульдог |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бассет" в секции "Быстрый поиск"
       То ссылка содержит "basset"
        * в поле "Порода" выбраны следующие значения:
          | value  |
          | Бассет |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бельгийская овчарка" в секции "Быстрый поиск"
       То ссылка содержит "belgian-shepherd-dog"
        * в поле "Порода" выбраны следующие значения:
          | value               |
          | Бельгийская овчарка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Болонка" в секции "Быстрый поиск"
       То ссылка содержит "lap-dog"
        * в поле "Порода" выбраны следующие значения:
          | value   |
          | Болонка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бордоский дог или Французский мастиф" в секции "Быстрый поиск"
       То ссылка содержит "bordosky-dog"
        * в поле "Порода" выбраны следующие значения:
          | value                                |
          | Бордоский дог или Французский мастиф |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бульмастиф" в секции "Быстрый поиск"
       То ссылка содержит "bulmastif"
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Бульмастиф |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Бультерьер" в секции "Быстрый поиск"
       То ссылка содержит "bullterrier"
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Бультерьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Восточно-европейская овчарка" в секции "Быстрый поиск"
       То ссылка содержит "veo"
        * в поле "Порода" выбраны следующие значения:
          | value                        |
          | Восточно-европейская овчарка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Далматин" в секции "Быстрый поиск"
       То ссылка содержит "dalmatin"
        * в поле "Порода" выбраны следующие значения:
          | value    |
          | Далматин |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Джек Рассел" в секции "Быстрый поиск"
       То ссылка содержит "jack-russell"
        * в поле "Порода" выбраны следующие значения:
          | value       |
          | Джек Рассел |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Доберман" в секции "Быстрый поиск"
       То ссылка содержит "doberman"
        * в поле "Порода" выбраны следующие значения:
          | value    |
          | Доберман |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Западносибирская лайка" в секции "Быстрый поиск"
       То ссылка содержит "zapadnosibirskaya-laika"
        * в поле "Порода" выбраны следующие значения:
          | value                  |
          | Западносибирская лайка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Золотистый ретривер" в секции "Быстрый поиск"
       То ссылка содержит "golden-retrievers"
        * в поле "Порода" выбраны следующие значения:
          | value               |
          | Золотистый ретривер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Ирландский сеттер" в секции "Быстрый поиск"
       То ссылка содержит "irish-setter"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
        * в поле "Порода" выбраны следующие значения:
          | value              |
          | Английский бульдог |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Ирландский терьер" в секции "Быстрый поиск"
       То ссылка содержит "irish-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value             |
          | Ирландский терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Йоркширский терьер" в секции "Быстрый поиск"
       То ссылка содержит "yorkshire-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value              |
          | Йоркширский терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Кавказская овчарка" в секции "Быстрый поиск"
       То ссылка содержит "caucasian-shepherd-dog"
        * в поле "Порода" выбраны следующие значения:
          | value              |
          | Кавказская овчарка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Кане корсо" в секции "Быстрый поиск"
       То ссылка содержит "cane-corso"
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Кане корсо |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Карликовый пинчер" в секции "Быстрый поиск"
       То ссылка содержит "dwarf-pinscher"
        * в поле "Порода" выбраны следующие значения:
          | value             |
          | Карликовый пинчер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Керри-блю терьер" в секции "Быстрый поиск"
       То ссылка содержит "kerry-blue-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value            |
          | Керри-блю терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Кокер-спаниель" в секции "Быстрый поиск"
       То ссылка содержит "cocker-spaniel"
        * в поле "Порода" выбраны следующие значения:
          | value          |
          | Кокер-спаниель |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Колли длинношерстный" в секции "Быстрый поиск"
       То ссылка содержит "collie"
        * в поле "Порода" выбраны следующие значения:
          | value                |
          | Колли длинношерстный |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Лабрадор ретривер" в секции "Быстрый поиск"
       То ссылка содержит "labrador-retrievers"
        * в поле "Порода" выбраны следующие значения:
          | value             |
          | Лабрадор ретривер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Лхасский апсо" в секции "Быстрый поиск"
       То ссылка содержит "lhasa-apso"
        * в поле "Порода" выбраны следующие значения:
          | value         |
          | Лхасский апсо |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Мастиф" в секции "Быстрый поиск"
       То ссылка содержит "mastiff"
        * в поле "Порода" выбраны следующие значения:
          | value  |
          | Мастиф |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Миттельшнауцер или Стандартный шнауцер" в секции "Быстрый поиск"
       То ссылка содержит "schnauzer"
        * в поле "Порода" выбраны следующие значения:
          | value                                  |
          | Миттельшнауцер или Стандартный шнауцер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Мопс" в секции "Быстрый поиск"
       То ссылка содержит "pug"
        * в поле "Порода" выбраны следующие значения:
          | value |
          | Мопс  |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Немецкая овчарка" в секции "Быстрый поиск"
       То ссылка содержит "german-shepherd"
        * в поле "Порода" выбраны следующие значения:
          | value            |
          | Немецкая овчарка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Немецкий боксер" в секции "Быстрый поиск"
       То ссылка содержит "german-boxer"
        * в поле "Порода" выбраны следующие значения:
          | value           |
          | Немецкий боксер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Немецкий дог" в секции "Быстрый поиск"
       То ссылка содержит "german-dog"
        * в поле "Порода" выбраны следующие значения:
          | value        |
          | Немецкий дог |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Папийон или Континентальной той-спаниель" в секции "Быстрый поиск"
       То ссылка содержит "papiyon"
        * в поле "Порода" выбраны следующие значения:
          | value                                    |
          | Папийон или Континентальной той-спаниель |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Пекинес" в секции "Быстрый поиск"
       То ссылка содержит "pekinese"
        * в поле "Порода" выбраны следующие значения:
          | value   |
          | Пекинес |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Пит-бультерьер" в секции "Быстрый поиск"
       То ссылка содержит "pitbul"
        * в поле "Порода" выбраны следующие значения:
          | value          |
          | Пит-бультерьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Померанский шпиц" в секции "Быстрый поиск"
       То ссылка содержит "pomeranian-spitz"
        * в поле "Порода" выбраны следующие значения:
          | value            |
          | Померанский шпиц |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Пудель" в секции "Быстрый поиск"
       То ссылка содержит "poodle"
        * в поле "Порода" выбраны следующие значения:
          | value  |
          | Пудель |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Ризен-шнауцер или Гигантский шнауцер" в секции "Быстрый поиск"
       То ссылка содержит "rizen-schnauzer"
        * в поле "Порода" выбраны следующие значения:
          | value                                |
          | Ризен-шнауцер или Гигантский шнауцер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Ротвейлер" в секции "Быстрый поиск"
       То ссылка содержит "rottweiler"
        * в поле "Порода" выбраны следующие значения:
          | value     |
          | Ротвейлер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Русская борзая" в секции "Быстрый поиск"
       То ссылка содержит "russian-borzoi"
        * в поле "Порода" выбраны следующие значения:
          | value          |
          | Русская борзая |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Русский черный терьер" в секции "Быстрый поиск"
       То ссылка содержит "russian-black-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value                 |
          | Русский черный терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Самоедская лайка" в секции "Быстрый поиск"
       То ссылка содержит "samoedskaya-laika"
        * в поле "Порода" выбраны следующие значения:
          | value            |
          | Самоедская лайка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Сенбернар" в секции "Быстрый поиск"
       То ссылка содержит "st-bernard-dog"
        * в поле "Порода" выбраны следующие значения:
          | value     |
          | Сенбернар |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Сибирский хаски" в секции "Быстрый поиск"
       То ссылка содержит "siberian-husky"
        * в поле "Порода" выбраны следующие значения:
          | value           |
          | Сибирский хаски |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Скай-терьер" в секции "Быстрый поиск"
       То ссылка содержит "sky-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value       |
          | Скай-терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Скотч-терьер" в секции "Быстрый поиск"
       То ссылка содержит "scotch-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value        |
          | Скотч-терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Среднеазиатская овчарка" в секции "Быстрый поиск"
       То ссылка содержит "central-asian-shepherd-dog"
        * в поле "Порода" выбраны следующие значения:
          | value                   |
          | Среднеазиатская овчарка |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Стаффордширский терьер" в секции "Быстрый поиск"
       То ссылка содержит "staffordshire-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value                  |
          | Стаффордширский терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Такса" в секции "Быстрый поиск"
       То ссылка содержит "dachshund"
        * в поле "Порода" выбраны следующие значения:
          | value |
          | Такса |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Той-терьер" в секции "Быстрый поиск"
       То ссылка содержит "toy-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Той-терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Фокстерьер" в секции "Быстрый поиск"
       То ссылка содержит "fox-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value      |
          | Фокстерьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Французский бульдог" в секции "Быстрый поиск"
       То ссылка содержит "french-bulldog"
        * в поле "Порода" выбраны следующие значения:
          | value               |
          | Французский бульдог |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Цвергшнауцер" в секции "Быстрый поиск"
       То ссылка содержит "miniature"
        * в поле "Порода" выбраны следующие значения:
          | value        |
          | Цвергшнауцер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Вэст-хайленд-уайт-терьер, или Белый высокогорный терьер" в секции "Быстрый поиск"
       То ссылка содержит "west-highland-white-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value                                                   |
          | Вэст-хайленд-уайт-терьер, или Белый высокогорный терьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Чау-чау" в секции "Быстрый поиск"
       То ссылка содержит "chow-chow"
        * в поле "Порода" выбраны следующие значения:
          | value   |
          | Чау-чау |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Чихуа-хуа" в секции "Быстрый поиск"
       То ссылка содержит "chihua-hua"
        * в поле "Порода" выбраны следующие значения:
          | value     |
          | Чихуа-хуа |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Шарпей" в секции "Быстрый поиск"
       То ссылка содержит "shar-pei"
        * в поле "Порода" выбраны следующие значения:
          | value  |
          | Шарпей |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Шелти" в секции "Быстрый поиск"
       То ссылка содержит "sheltie"
        * в поле "Порода" выбраны следующие значения:
          | value |
          | Шелти |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Ши-тцу" в секции "Быстрый поиск"
       То ссылка содержит "shi-ttsu"
        * в поле "Порода" выбраны следующие значения:
          | value  |
          | Ши-тцу |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Эрдельтерьер" в секции "Быстрый поиск"
       То ссылка содержит "airedale-terrier"
        * в поле "Порода" выбраны следующие значения:
          | value        |
          | Эрдельтерьер |

  Сценарий: Фильтр
    Когда я выбираю ссылку "Японский хин" в секции "Быстрый поиск"
       То ссылка содержит "japanese-hin"
        * в поле "Порода" выбраны следующие значения:
          | value        |
          | Японский хин |
