# language:ru
# encoding: utf-8
Функционал: Одежда, обувь, аксессуары -> Мужская одежда - seo-линки

  Контекст:
    Когда открыта страница для региона "Россия"
        * на главной странице я перехожу в категорию "Одежда, обувь, аксессуары -> Мужская одежда"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по мужским брюкам
    Когда я выбираю ссылку "Мужские брюки" в секции "Быстрый поиск"
       То ссылка содержит "trousers"
        * значение в поле "Ключевые слова" равно "брюки"

  Сценарий: Фильтр по джемперам
    Когда я выбираю ссылку "Джемпера" в секции "Быстрый поиск"
       То ссылка содержит "jumper"
        * значение в поле "Ключевые слова" равно "джемпер"

  Сценарий: Фильтр по джинсам
    Когда я выбираю ссылку "Джинсы" в секции "Быстрый поиск"
       То ссылка содержит "jeans"
        * значение в поле "Ключевые слова" равно "джинсы"

  Сценарий: Фильтр по мужским костюмам
    Когда я выбираю ссылку "Мужские костюмы" в секции "Быстрый поиск"
       То ссылка содержит "suit"
        * значение в поле "Ключевые слова" равно "костюм"

  Сценарий: Фильтр по курткам
    Когда я выбираю ссылку "Куртки" в секции "Быстрый поиск"
       То ссылка содержит "kurtka"
        * значение в поле "Ключевые слова" равно "куртка"

  Сценарий: Фильтр по мужскому нижнему белью
    Когда я выбираю ссылку "Мужское нижнее бельё" в секции "Быстрый поиск"
       То ссылка содержит "body-cloth"
        * в поле "Вид одежды" выбрано значение "нижнее бельё"

  Сценарий: Фильтр по пальто
    Когда я выбираю ссылку "Пальто" в секции "Быстрый поиск"
       То ссылка содержит "coat"
        * значение в поле "Ключевые слова" равно "пальто"

  Сценарий: Фильтр по пиджакам
    Когда я выбираю ссылку "Пиджаки" в секции "Быстрый поиск"
       То ссылка содержит "jacket"
        * значение в поле "Ключевые слова" равно "пиджак"

  Сценарий: Фильтр по плащам
    Когда я выбираю ссылку "Плащ" в секции "Быстрый поиск"
       То ссылка содержит "raincoat"
        * значение в поле "Ключевые слова" равно "плащ"

  Сценарий: Фильтр по рубашкам
    Когда я выбираю ссылку "Рубашки" в секции "Быстрый поиск"
       То ссылка содержит "shirt"
        * значение в поле "Ключевые слова" равно "Рубашки"

  Сценарий: Фильтр по свитерам
    Когда я выбираю ссылку "Свитера" в секции "Быстрый поиск"
       То ссылка содержит "sweater"
        * значение в поле "Ключевые слова" равно "свитер"

  Сценарий: Фильтр по футболкам
    Когда я выбираю ссылку "Футболки" в секции "Быстрый поиск"
       То ссылка содержит "t-shirt"
        * значение в поле "Ключевые слова" равно "футболка"

  Сценарий: Фильтр по мужским шапкам
    Когда я выбираю ссылку "Мужские шапки" в секции "Быстрый поиск"
       То ссылка содержит "cap"
        * значение в поле "Ключевые слова" равно "шапки"

  Сценарий: Фильтр по женским шортам
    Когда я выбираю ссылку "Женские шорты" в секции "Быстрый поиск"
       То ссылка содержит "shorts"
        * значение в поле "Ключевые слова" равно "шорты"
