# language:ru
# encoding: utf-8
Функционал: Одежда, обувь, аксессуары -> Женская одежда - seo-линки

  Контекст:
    Когда открыта страница для региона "Россия"
        * на главной странице я перехожу в категорию "Одежда, обувь, аксессуары -> Женская одежда"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по блузкам
    Когда я выбираю ссылку "Блузки" в секции "Быстрый поиск"
       То ссылка содержит "blouse"
        * значение в поле "Ключевые слова" равно "блузки"

  Сценарий: Фильтр по женским брюкам
    Когда я выбираю ссылку "Женские брюки" в секции "Быстрый поиск"
       То ссылка содержит "slacks"
        * значение в поле "Ключевые слова" равно "брюки"

  Сценарий: Фильтр по джемперам
    Когда я выбираю ссылку "Джемпера" в секции "Быстрый поиск"
       То ссылка содержит "jumper"
        * значение в поле "Ключевые слова" равно "джемпер"

  Сценарий: Фильтр по джинсам
    Когда я выбираю ссылку "Джинсы" в секции "Быстрый поиск"
       То ссылка содержит "jeans"
        * значение в поле "Ключевые слова" равно "джинсы"

  Сценарий: Фильтр по дублёнкам
    Когда я выбираю ссылку "Дублёнки" в секции "Быстрый поиск"
       То ссылка содержит "sheepskin"
        * значение в поле "Ключевые слова" равно "дубленка"

  Сценарий: Фильтр по женским костюмам
    Когда я выбираю ссылку "Женские костюмы" в секции "Быстрый поиск"
       То ссылка содержит "suit"
        * значение в поле "Ключевые слова" равно "костюм"

  Сценарий: Фильтр по кофтам
    Когда я выбираю ссылку "Кофты" в секции "Быстрый поиск"
       То ссылка содержит "jupe"
        * значение в поле "Ключевые слова" равно "кофты"

  Сценарий: Фильтр по купальникам
    Когда я выбираю ссылку "Купальники" в секции "Быстрый поиск"
       То ссылка содержит "swimwear"
        * значение в поле "Ключевые слова" равно "купальники"

  Сценарий: Фильтр по курткам
    Когда я выбираю ссылку "Куртки" в секции "Быстрый поиск"
       То ссылка содержит "kurtka"
        * значение в поле "Ключевые слова" равно "куртка"

  Сценарий: Фильтр по женскому нижнему белью
    Когда я выбираю ссылку "Женское нижнее бельё" в секции "Быстрый поиск"
       То ссылка содержит "body-cloth"
        * в поле "Вид одежды" выбрано значение "нижнее бельё"

  Сценарий: Фильтр по пальто
    Когда я выбираю ссылку "Пальто" в секции "Быстрый поиск"
       То ссылка содержит "coat"
        * значение в поле "Ключевые слова" равно "пальто"

  Сценарий: Фильтр по женским пиджакам
    Когда я выбираю ссылку "Женские пиджаки" в секции "Быстрый поиск"
       То ссылка содержит "jacket"
        * значение в поле "Ключевые слова" равно "пиджак"

  Сценарий: Фильтр по платьям
    Когда я выбираю ссылку "Платье" в секции "Быстрый поиск"
       То ссылка содержит "dress"
        * значение в поле "Ключевые слова" равно "платье"

  Сценарий: Фильтр по плащам
    Когда я выбираю ссылку "Плащ" в секции "Быстрый поиск"
       То ссылка содержит "raincoat"
        * значение в поле "Ключевые слова" равно "плащ"

  Сценарий: Фильтр по женским рубашкам
    Когда я выбираю ссылку "Женские рубашки" в секции "Быстрый поиск"
       То ссылка содержит "shirt"
        * значение в поле "Ключевые слова" равно "Рубашки"

  Сценарий: Фильтр по сарафанам
    Когда я выбираю ссылку "Сарафан" в секции "Быстрый поиск"
       То ссылка содержит "sarafan"
        * значение в поле "Ключевые слова" равно "сарафан"

  Сценарий: Фильтр по свитерам
    Когда я выбираю ссылку "Свитера" в секции "Быстрый поиск"
       То ссылка содержит "sweater"
        * значение в поле "Ключевые слова" равно "свитер"

  Сценарий: Фильтр по спортивной одежде
    Когда я выбираю ссылку "Спортивная одежда" в секции "Быстрый поиск"
       То ссылка содержит "sports-clothes"
        * в поле "Вид одежды" выбрано значение "спортивная одежда"

  Сценарий: Фильтр по туникам
    Когда я выбираю ссылку "Туники" в секции "Быстрый поиск"
       То ссылка содержит "tunic"
        * значение в поле "Ключевые слова" равно "туника"

  Сценарий: Фильтр по футболкам
    Когда я выбираю ссылку "Футболки" в секции "Быстрый поиск"
       То ссылка содержит "t-shirt"
        * значение в поле "Ключевые слова" равно "футболка"

  Сценарий: Фильтр по халатам
    Когда я выбираю ссылку "Халаты" в секции "Быстрый поиск"
       То ссылка содержит "wrapper"
        * значение в поле "Ключевые слова" равно "халат"

  Сценарий: Фильтр по женским шортам
    Когда я выбираю ссылку "Женские шорты" в секции "Быстрый поиск"
       То ссылка содержит "shorts"
        * значение в поле "Ключевые слова" равно "шорты"

  Сценарий: Фильтр по шубам
    Когда я выбираю ссылку "Шубы" в секции "Быстрый поиск"
       То ссылка содержит "fur"
        * значение в поле "Ключевые слова" равно "шуба"

  Сценарий: Фильтр по большим размерам
    Когда я выбираю ссылку "Женская одежда большого размера" в секции "Быстрый поиск"
       То ссылка содержит "large"
        * в поле "Размер" выбраны следующие значения:
          | value |
          | 54    |
          | 56    |
          | 58    |
