# language:ru
# encoding: utf-8
Функционал: Строительство и ремонт -> Сантехника -> Кухонные мойки - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Строительство и ремонт -> Сантехника -> Кухонные мойки"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по Alveus
    Когда я выбираю ссылку "Alveus" в секции "Быстрый поиск"
       То ссылка содержит "alveus"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "alveus"

  Сценарий: Фильтр по Blanco
    Когда я выбираю ссылку "Blanco" в секции "Быстрый поиск"
       То ссылка содержит "blanco"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "blanco"

  Сценарий: Фильтр по Franke
    Когда я выбираю ссылку "Franke" в секции "Быстрый поиск"
       То ссылка содержит "franke"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "franke"

  Сценарий: Фильтр по Reginox
    Когда я выбираю ссылку "Reginox" в секции "Быстрый поиск"
       То ссылка содержит "reginox"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "reginox"

  Сценарий: Фильтр по Schock
    Когда я выбираю ссылку "Schock" в секции "Быстрый поиск"
       То ссылка содержит "schock"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "schock"

  Сценарий: Фильтр по Teka
    Когда я выбираю ссылку "Teka" в секции "Быстрый поиск"
       То ссылка содержит "teka"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "teka"
