# language:ru
# encoding: utf-8
Функционал: Строительство и ремонт -> Сантехника -> Унитазы, писсуары, биде - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Строительство и ремонт -> Сантехника -> Унитазы, писсуары, биде"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по Cersanit
    Когда я выбираю ссылку "Cersanit" в секции "Быстрый поиск"
       То ссылка содержит "cersanit"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "cersanit"

  Сценарий: Фильтр по Duravit
    Когда я выбираю ссылку "Duravit" в секции "Быстрый поиск"
       То ссылка содержит "duravit"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "duravit"

  Сценарий: Фильтр по Gustavsberg
    Когда я выбираю ссылку "Gustavsberg" в секции "Быстрый поиск"
       То ссылка содержит "gustavsberg"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "gustavsberg"

  Сценарий: Фильтр по Ideal
    Когда я выбираю ссылку "Ideal" в секции "Быстрый поиск"
       То ссылка содержит "ideal"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "ideal"

  Сценарий: Фильтр по Ido
    Когда я выбираю ссылку "Ido" в секции "Быстрый поиск"
       То ссылка содержит "ido"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "ido"

  Сценарий: Фильтр по Jacob Delafon
    Когда я выбираю ссылку "Jacob Delafon" в секции "Быстрый поиск"
       То ссылка содержит "jacob-delafon"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "delafon"

  Сценарий: Фильтр по Laufen
    Когда я выбираю ссылку "Laufen" в секции "Быстрый поиск"
       То ссылка содержит "laufen"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "laufen"

  Сценарий: Фильтр по Roca
    Когда я выбираю ссылку "Roca" в секции "Быстрый поиск"
       То ссылка содержит "roca"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "roca"

  Сценарий: Фильтр по Santek
    Когда я выбираю ссылку "Santek" в секции "Быстрый поиск"
       То ссылка содержит "santek"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "santek"

  Сценарий: Фильтр по Twyford
    Когда я выбираю ссылку "Twyford" в секции "Быстрый поиск"
       То ссылка содержит "twyford"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "twyford"

  Сценарий: Фильтр по Villeroy
    Когда я выбираю ссылку "Villeroy" в секции "Быстрый поиск"
       То ссылка содержит "villeroy"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * значение в поле "Ключевые слова" равно "villeroy"
