# language:ru
# encoding: utf-8
Функционал: Строительство и ремонт -> Сантехника -> Водонагреватели - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Строительство и ремонт -> Сантехника -> Водонагреватели"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по AEG
    Когда я выбираю ссылку "AEG" в секции "Быстрый поиск"
       То ссылка содержит "aeg"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "aeg"

  Сценарий: Фильтр по Ariston
    Когда я выбираю ссылку "Ariston" в секции "Быстрый поиск"
       То ссылка содержит "ariston"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "ariston"

  Сценарий: Фильтр по Edisson
    Когда я выбираю ссылку "Edisson" в секции "Быстрый поиск"
       То ссылка содержит "edisson"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "edisson"

  Сценарий: Фильтр по Electrolux
    Когда я выбираю ссылку "Electrolux" в секции "Быстрый поиск"
       То ссылка содержит "electrolux"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "electrolux"

  Сценарий: Фильтр по Polaris
    Когда я выбираю ссылку "Polaris" в секции "Быстрый поиск"
       То ссылка содержит "polaris"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "polaris"

  Сценарий: Фильтр по Stiebel
    Когда я выбираю ссылку "Stiebel" в секции "Быстрый поиск"
       То ссылка содержит "stiebel"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "stiebel"

  Сценарий: Фильтр по Thermex
    Когда я выбираю ссылку "Thermex" в секции "Быстрый поиск"
       То ссылка содержит "thermex"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "thermex"

  Сценарий: Фильтр по Timberk
    Когда я выбираю ссылку "Timberk" в секции "Быстрый поиск"
       То ссылка содержит "timberk"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
          | куплю  |
        * в значение в поле "Ключевые слова" выбрано "timberk"
