# language:ru
# encoding: utf-8
Функционал: Строительство и ремонт -> Материалы -> Облицовочные и отделочные - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Строительство и ремонт -> Материалы -> Облицовочные и отделочные"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по гипсокартону
    Когда я выбираю ссылку "Гипсокартон" в секции "Быстрый поиск"
       То ссылка содержит "plasterboard"
        * в поле "Тип материала" выбраны следующие значения:
          | value       |
          | гипсокартон |

  Сценарий: Фильтр по керамической плитке
    Когда я выбираю ссылку "Керамическая плитка" в секции "Быстрый поиск"
       То ссылка содержит "ceramic-tiles"
        * в поле "Тип материала" выбраны следующие значения:
          | value               |
          | керамическая плитка |

  Сценарий: Фильтр по ковровым покрытиям
    Когда я выбираю ссылку "Ковровые покрытия" в секции "Быстрый поиск"
       То ссылка содержит "carpeting"
        * в поле "Тип материала" выбраны следующие значения:
          | value               |
          | ковровые покрытия |

  Сценарий: Фильтр по ламинату
    Когда я выбираю ссылку "Ламинат" в секции "Быстрый поиск"
       То ссылка содержит "laminate"
        * в поле "Тип материала" выбраны следующие значения:
          | value   |
          | ламинат |

  Сценарий: Фильтр по линолеуму
    Когда я выбираю ссылку "Линолеум" в секции "Быстрый поиск"
       То ссылка содержит "linoleum"
        * в поле "Тип материала" выбраны следующие значения:
          | value    |
          | линолеум |

  Сценарий: Фильтр по обоям
    Когда я выбираю ссылку "Обои" в секции "Быстрый поиск"
       То ссылка содержит "wallpaper"
        * в поле "Тип материала" выбраны следующие значения:
          | value |
          | обои  |

  Сценарий: Фильтр по отделочному камню
    Когда я выбираю ссылку "Отделочный камень" в секции "Быстрый поиск"
       То ссылка содержит "stone"
        * в поле "Тип материала" выбраны следующие значения:
          | value             |
          | отделочный камень |

  Сценарий: Фильтр по панелям ПВХ и МДФ
    Когда я выбираю ссылку "Панели ПВХ и МДФ" в секции "Быстрый поиск"
       То ссылка содержит "panels"
        * в поле "Тип материала" выбраны следующие значения:
          | value            |
          | панели ПВХ и МДФ |

  Сценарий: Фильтр по паркету
    Когда я выбираю ссылку "Паркет" в секции "Быстрый поиск"
       То ссылка содержит "parquet"
        * в поле "Тип материала" выбраны следующие значения:
          | value  |
          | паркет |

  Сценарий: Фильтр по плинтусу
    Когда я выбираю ссылку "Плинтус" в секции "Быстрый поиск"
       То ссылка содержит "skirting"
        * в поле "Тип материала" выбраны следующие значения:
          | value   |
          | плинтус |

  Сценарий: Фильтр по потолкам
    Когда я выбираю ссылку "Потолки" в секции "Быстрый поиск"
       То ссылка содержит "ceilings"
        * в поле "Тип материала" выбраны следующие значения:
          | value   |
          | потолки |

  Сценарий: Фильтр по сайдингу
    Когда я выбираю ссылку "Сайдинг" в секции "Быстрый поиск"
       То ссылка содержит "siding"
        * в поле "Тип материала" выбраны следующие значения:
          | value   |
          | сайдинг |

  Сценарий: Фильтр по фальшполу
    Когда я выбираю ссылку "Фальшпол" в секции "Быстрый поиск"
       То ссылка содержит "raised-floor"
        * в поле "Тип материала" выбраны следующие значения:
          | value    |
          | фальшпол |
