# language:ru
# encoding: utf-8
Функционал: Бизнес и партнерство -> Готовый бизнес -> Бизнес под ключ - seo-линки

  Контекст:
    Когда открыта страница для региона "Россия"
        * на главной странице я перехожу в категорию "Бизнес и партнерство -> Готовый бизнес -> Бизнес под ключ"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по магазинам
    Когда я выбираю ссылку "Магазины, павильоны, киоски" в секции "Быстрый поиск"
       То ссылка содержит "shops"
        * в поле "Тип бизнеса" выбрано значение "магазины, павильоны, киоски"

  Сценарий: Фильтр по производству
    Когда я выбираю ссылку "Производство" в секции "Быстрый поиск"
       То ссылка содержит "production"
        * в поле "Тип бизнеса" выбрано значение "производство"

  Сценарий: Фильтр по салонам красоты
    Когда я выбираю ссылку "Салоны красоты, парикмахерские" в секции "Быстрый поиск"
       То ссылка содержит "krasota"
        * в поле "Тип бизнеса" выбрано значение "салоны красоты, парикмахерские"

  Сценарий: Фильтр по автосервисам
    Когда я выбираю ссылку "Автосервисы, автомойки, автосалоны" в секции "Быстрый поиск"
       То ссылка содержит "auto"
        * в поле "Тип бизнеса" выбрано значение "автосервисы, автомойки, автосалоны"

  Сценарий: Фильтр по медцентрам
    Когда я выбираю ссылку "Медицинские центры, аптеки" в секции "Быстрый поиск"
       То ссылка содержит "medicine"
        * в поле "Тип бизнеса" выбрано значение "медицинские центры, аптеки"

  Сценарий: Фильтр по гостиницам
    Когда я выбираю ссылку "Гостиницы, отели, базы отдыха" в секции "Быстрый поиск"
       То ссылка содержит "hotel"
        * в поле "Тип бизнеса" выбрано значение "гостиницы, отели, базы отдыха"

  Сценарий: Фильтр по телекоммуникациям
    Когда я выбираю ссылку "Телекоммуникации, интернет, реклама" в секции "Быстрый поиск"
       То ссылка содержит "media"
        * в поле "Тип бизнеса" выбрано значение "телекоммуникации, интернет, реклама"

  Сценарий: Фильтр по фитнес-центрам
    Когда я выбираю ссылку "Фитнес-центры, спорт-клубы" в секции "Быстрый поиск"
       То ссылка содержит "sport"
        * в поле "Тип бизнеса" выбрано значение "фитнес-центры, спорт клубы"

  Сценарий: Фильтр по туристическим фирмам
    Когда я выбираю ссылку "Туристические фирмы, турагентства, туроператоры" в секции "Быстрый поиск"
       То ссылка содержит "turizm"
        * в поле "Тип бизнеса" выбрано значение "туристические фирмы, туроператоры, турагентства"

  Сценарий: Фильтр по сельскому хозяйству
    Когда я выбираю ссылку "Сельское хозяйство" в секции "Быстрый поиск"
       То ссылка содержит "selhoz"
        * в поле "Тип бизнеса" выбрано значение "сельскохозяйственный комплекс"
