# language:ru
# encoding: utf-8
Функционал: Товары для детей -> Детская одежда - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Товары для детей -> Детская одежда"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по детским брюкам
    Когда я выбираю ссылку "Детские брюки" в секции "Быстрый поиск"
       То ссылка содержит "slacks"
        * поле "Ключевые слова" равно "брюки"

  Сценарий: Фильтр по детским джинсам
    Когда я выбираю ссылку "Детские джинсы" в секции "Быстрый поиск"
       То ссылка содержит "jeans"
        * поле "Ключевые слова" равно "джинсы"

  Сценарий: Фильтр по детским комбинезонам
    Когда я выбираю ссылку "Детские комбинезоны" в секции "Быстрый поиск"
       То ссылка содержит "jumpers"
        * поле "Ключевые слова" равно "комбинезон"

  Сценарий: Фильтр по детским курткам
    Когда я выбираю ссылку "Детские куртки" в секции "Быстрый поиск"
       То ссылка содержит "raincoat"
        * поле "Ключевые слова" равно "куртки"

  Сценарий: Фильтр по детским пальто
    Когда я выбираю ссылку "Детские пальто" в секции "Быстрый поиск"
       То ссылка содержит "coat"
        * поле "Ключевые слова" равно "пальто"

  Сценарий: Фильтр по платьям для девочек
    Когда я выбираю ссылку "Платья для девочек" в секции "Быстрый поиск"
       То ссылка содержит "dress"
        * поле "Ключевые слова" равно "платье"

  Сценарий: Фильтр по детским рубашкам
    Когда я выбираю ссылку "Детские рубашки" в секции "Быстрый поиск"
       То ссылка содержит "shirt"
        * поле "Ключевые слова" равно "рубашка"

  Сценарий: Фильтр по свитерам
    Когда я выбираю ссылку "Свитера" в секции "Быстрый поиск"
       То ссылка содержит "sweater"
        * поле "Ключевые слова" равно "свитер"

  Сценарий: Фильтр по детским футболкам
    Когда я выбираю ссылку "Детские футболки" в секции "Быстрый поиск"
       То ссылка содержит "t-shirts"
        * поле "Ключевые слова" равно "футболка"

  Сценарий: Фильтр по детским шапкам
    Когда я выбираю ссылку "Детские шапки" в секции "Быстрый поиск"
       То ссылка содержит "caps"
        * поле "Ключевые слова" равно "шапка"

  Сценарий: Фильтр по юбкам для девочек
    Когда я выбираю ссылку "Юбки для девочек" в секции "Быстрый поиск"
       То ссылка содержит "skirt"
        * поле "Ключевые слова" равно "юбки"

  Сценарий: Фильтр по детской зимней одежде
    Когда я выбираю ссылку "Детская зимняя одежда" в секции "Быстрый поиск"
       То ссылка содержит "winter"
        * поле "Ключевые слова" равно "зимний"

  Сценарий: Фильтр по детской зимней одежде
    Когда я выбираю ссылку "Детская зимняя одежда" в секции "Быстрый поиск"
       То ссылка содержит "winter"
        * поле "Ключевые слова" равно "зимний"

  Сценарий: Фильтр по весенней одежде
    Когда я выбираю ссылку "Весенняя одежда" в секции "Быстрый поиск"
       То ссылка содержит "spring"
        * поле "Ключевые слова" равно "весенний"

  Сценарий: Фильтр по детской летней одежде
    Когда я выбираю ссылку "Детская летняя одежда" в секции "Быстрый поиск"
       То ссылка содержит "summer"
        * поле "Ключевые слова" равно "летний"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по осенней одежде
    Когда я выбираю ссылку "Осенняя одежда" в секции "Быстрый поиск"
       То ссылка содержит "autumn"
        * поле "Ключевые слова" равно "осенний"
