# language:ru
# encoding: utf-8
Функционал: Компьютерная техника -> Мультимедиа -> Веб-камеры - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Компьютерная техника -> Мультимедиа -> Веб-камеры"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по A4Tech
    Когда я выбираю ссылку "A4Tech" в секции "Быстрый поиск"
       То ссылка содержит "a4tech"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "A4Tech"

  Сценарий: Фильтр по A4Tech
    Когда я выбираю ссылку "A4Tech" в секции "Быстрый поиск"
       То ссылка содержит "a4tech"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "A4Tech"

  Сценарий: Фильтр по Creative
    Когда я выбираю ссылку "Creative" в секции "Быстрый поиск"
       То ссылка содержит "creative"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Creative"

  Сценарий: Фильтр по G-CUBE
    Когда я выбираю ссылку "G-CUBE" в секции "Быстрый поиск"
       То ссылка содержит "g-cube"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "G-CUBE"

  Сценарий: Фильтр по Gembird
    Когда я выбираю ссылку "Gembird" в секции "Быстрый поиск"
       То ссылка содержит "gembird"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Gembird"

  Сценарий: Фильтр по Genius
    Когда я выбираю ссылку "Genius" в секции "Быстрый поиск"
       То ссылка содержит "genius"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Genius"

  Сценарий: Фильтр по Kreolz
    Когда я выбираю ссылку "Kreolz" в секции "Быстрый поиск"
       То ссылка содержит "kreolz"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Kreolz"

  Сценарий: Фильтр по Logitech
    Когда я выбираю ссылку "Logitech" в секции "Быстрый поиск"
       То ссылка содержит "logitech"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Logitech"

  Сценарий: Фильтр по Logitech
    Когда я выбираю ссылку "Logitech" в секции "Быстрый поиск"
       То ссылка содержит "logitech"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Logitech"

  Сценарий: Фильтр по Microsoft
    Когда я выбираю ссылку "Microsoft" в секции "Быстрый поиск"
       То ссылка содержит "microsoft"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Microsoft"

  Сценарий: Фильтр по Trust
    Когда я выбираю ссылку "Trust" в секции "Быстрый поиск"
       То ссылка содержит "trust"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | Продам |
        * значение в поле "Ключевые слова" равно "Trust"
