# language:ru
# encoding: utf-8
Функционал: Мебель, интерьер, обиход -> Мебель для кухни -> Кухонные гарнитуры - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Мебель, интерьер, обиход -> Мебель для кухни -> Кухонные гарнитуры"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по угловым
    Когда я выбираю ссылку "Угловые кухни" в секции "Быстрый поиск"
       То ссылка содержит "uglovye"
        * в поле "Угловая" выбрано значение "да"
