# language:ru
# encoding: utf-8
Функционал: Праздники и подарки -> Подарки для декора и интерьера - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        * на главной странице я перехожу в категорию "Праздники и подарки -> Подарки для декора и интерьера"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по сувенирам
    Когда я выбираю ссылку "Сувениры" в секции "Быстрый поиск"
       То ссылка содержит "gifts"
        * в поле "Тип" выбрано значение "сувениры"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по фигуркам
    Когда я выбираю ссылку "Фигурки" в секции "Быстрый поиск"
       То ссылка содержит "figures"
        * в поле "Тип" выбрано значение "фигурки"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по шкатулкам
    Когда я выбираю ссылку "Шкатулки" в секции "Быстрый поиск"
       То ссылка содержит "cascets"
        * в поле "Тип" выбрано значение "шкатулки"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по копилкам
    Когда я выбираю ссылку "Копилки" в секции "Быстрый поиск"
       То ссылка содержит "piggy-bank"
        * в поле "Тип" выбрано значение "копилки"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по фотоальбомам
    Когда я выбираю ссылку "Фотоальбомы" в секции "Быстрый поиск"
       То ссылка содержит "photograph-album"
        * в поле "Тип" выбрано значение "фотоальбомы"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по рамкам
    Когда я выбираю ссылку "Рамки для фотографий" в секции "Быстрый поиск"
       То ссылка содержит "photo-frames"
        * в поле "Тип" выбрано значение "рамки для фотографий"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по посуде
    Когда я выбираю ссылку "Посуда" в секции "Быстрый поиск"
       То ссылка содержит "dishes"
        * в поле "Тип" выбрано значение "посуда"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по вазам
    Когда я выбираю ссылку "Вазы" в секции "Быстрый поиск"
       То ссылка содержит "vases"
        * в поле "Тип" выбрано значение "вазы"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по картинам
    Когда я выбираю ссылку "Картины, постеры" в секции "Быстрый поиск"
       То ссылка содержит "paintings"
        * в поле "Тип" выбрано значение "картины, постеры"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по свечам
    Когда я выбираю ссылку "Свечи" в секции "Быстрый поиск"
       То ссылка содержит "candles"
        * в поле "Тип" выбрано значение "свечи"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
