# language:ru
# encoding: utf-8
Функционал: Праздники и подарки -> Хобби и развлечения - seo-линки

  Контекст:
    Когда открыта страница для региона "Россия"
        * на главной странице я перехожу в категорию "Праздники и подарки -> Хобби и развлечения"
        * на странице категории присутствует секция "Быстрый поиск"

  Сценарий: Фильтр по картам
    Когда я выбираю ссылку "Карты" в секции "Быстрый поиск"
       То ссылка содержит "cards"
        * значение в поле "Ключевые слова" равно "карты"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по нардам
    Когда я выбираю ссылку "Нарды" в секции "Быстрый поиск"
       То ссылка содержит "nard"
        * значение в поле "Ключевые слова" равно "нарды"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по настольным играм
    Когда я выбираю ссылку "Настольные игры" в секции "Быстрый поиск"
       То ссылка содержит "table-games"
        * значение в поле "Ключевые слова" равно "настольный"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по шахматам
    Когда я выбираю ссылку "Шахматы" в секции "Быстрый поиск"
       То ссылка содержит "chess"
        * значение в поле "Ключевые слова" равно "шахматы"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по мечам
    Когда я выбираю ссылку "Мечи" в секции "Быстрый поиск"
       То ссылка содержит "swords"
        * значение в поле "Ключевые слова" равно "мечи"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по ножам
    Когда я выбираю ссылку "Ножи" в секции "Быстрый поиск"
       То ссылка содержит "knifes"
        * значение в поле "Ключевые слова" равно "ножи"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по кинжалам
    Когда я выбираю ссылку "Кинжалы" в секции "Быстрый поиск"
       То ссылка содержит "daggers"
        * значение в поле "Ключевые слова" равно "кинжалы"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по пистолетам
    Когда я выбираю ссылку "Пистолеты" в секции "Быстрый поиск"
       То ссылка содержит "pistols"
        * значение в поле "Ключевые слова" равно "пистолеты"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по ружьям
    Когда я выбираю ссылку "Ружья" в секции "Быстрый поиск"
       То ссылка содержит "guns"
        * значение в поле "Ключевые слова" равно "ружье"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |

  Сценарий: Фильтр по масштабным моделям
    Когда я выбираю ссылку "Масштабные модели" в секции "Быстрый поиск"
       То ссылка содержит "models"
        * в поле "Тип" выбрано значение "масштабные модели"
        * в поле "Тип предложения" выбраны следующие значения:
          | value  |
          | продам |
