# language:ru
# encoding: utf-8
Функционал: Электроника и техника -> Техника для авто -> Автомобильные видеорегистраторы

  Контекст:
    Когда открыта страница для региона "Россия"
        И на главной странице я перехожу в категорию "Электроника и техника -> Техника для авто -> Автомобильные видеорегистраторы"

@visible_filter
  Сценарий: Видимые фильтры
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Тип предложения |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр                         |
         | Тип предложения                |
         | Состояние                      |
         | Цена                           |
         | Марка                          |
         | Конструкция                    |
         | Макс. разрешение видеозаписи   |
         | Угол обзора (диагональ), град. |
         | Датчик движения (G-сенсор)     |
         | Экран                          |
         | Поддержка карт памяти          |
         | Режим записи                   |
         | Ключевые слова                 |
         | С фото                         |
         | С видео                        |
         | Источник                       |
         | Поданные                       |


@all_results
  Сценарий: Все результаты
   Когда на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И сначала отображаются премиум-объявления
       И на странице показано <= 20 объявлений

  Сценарий: Фильтр по типу предложения
    Когда я делаю поиск по следующим параметрам:
      | parameter       | value  |
      | Тип предложения | продам |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Тип предложения" равно "продам"

  Сценарий: Фильтр по состоянию
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | Состояние | новый |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Состояние" равно "новый"

  Сценарий: Фильтр по цене
    Когда я делаю поиск по следующим параметрам:
        | parameter      | min  | max    | value |
        | Цена           | 100  | 100000 |       |
        | Валюта         |      |        | руб.  |
       И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении цена >= 100
       И в каждом объявлении цена <= 100000
       И в каждом объявлении валюта равна "руб."

  Сценарий: Фильтр по валюте
    Когда я делаю поиск по следующим параметрам:
      | parameter      | min  | max    | value |
      | Цена           | 100  | 100000 |       |
      | Валюта         |      |        | $     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении валюта равна "$"
       И в каждом объявлении цена >= 100
       И в каждом объявлении цена <= 100000

@customfield
  Сценарий: Фильтр по марке
    Когда я делаю поиск по следующим параметрам:
      | parameter | value   |
      | Марка     | Mystery |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Марка" равно "Mystery"

@customfield
  Сценарий: Фильтр по конструкции
    Когда я делаю поиск по следующим параметрам:
      | parameter   | value     |
      | Конструкция | с камерой |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Конструкция" равно "с камерой"

@customfield
  Сценарий: Фильтр по разрешению видеозаписи
    Когда я делаю поиск по следующим параметрам:
      | parameter                    | value    |
      | Макс. разрешение видеозаписи | 1280x960 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Макс. разрешение видеозаписи" равно "1280x960"

@customfield
  Сценарий: Фильтр по уголу обзора
    Когда я делаю поиск по следующим параметрам:
      | parameter                     | min | max |
      | Угол обзора (диагональ), град.| 1   | 180 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Угол обзора (диагональ), град." >= "1"
       И в деталях первого объявления "Угол обзора (диагональ), град." <= "180"

@customfield
  Сценарий: Фильтр по датчику движения
    Когда я делаю поиск по следующим параметрам:
      | parameter                  | value |
      | Датчик движения (G-сенсор) | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления присутствует "Датчик движения (G-сенсор)"

@customfield
  Сценарий: Фильтр по экрану
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | Экран     | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления присутствует "Экран"

@customfield
  Сценарий: Фильтр по поддержке карт памяти
    Когда я делаю поиск по следующим параметрам:
      | parameter             | value              |
      | Поддержка карт памяти | Compact Flash Card |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Поддержка карт памяти" равно "Compact Flash Card"

@customfield
  Сценарий: Фильтр по режиму записи
    Когда я делаю поиск по следующим параметрам:
      | parameter    | value       |
      | Режим записи | непрерывная |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Режим записи" равно "непрерывная"

  Сценарий: Фильтр по наличию фото
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | С фото    | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении отображается загруженная фотография

@empty_results
  Сценарий: Фильтр по наличию видео
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | С видео   | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления отображается видео

  Сценарий: Фильтр по источнику
    Когда я делаю поиск по следующим параметрам:
      | parameter | value       |
      | Источник  | Cайт IRR.RU |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении источник равен "Сайт IRR.RU"

@empty_results
  Сценарий: Фильтр по времени подачи
    Когда я делаю поиск по следующим параметрам:
      | parameter | value    |
      | Поданные  | за месяц |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И каждое объявление подано не более 31 дней назад

@bugs @bug34183
  Сценарий: Фильтр по ключевому слову в заголовке объявления
    Когда я указываю искать только в заголовках объявления
        И я ищу "сабвуфер"
        И на странице поиска загружен список результатов

       То на странице показано >= 1 объявлений
        И в заголовке каждого объявления содержится "сабвуфер"

@bugs @bug34183
  Сценарий: Фильтр по ключевому слову
    Когда я ищу "сабвуфер"
        И на странице поиска загружен список результатов

       То на странице показано >= 1 объявлений
        И в первом объявлении содержится "сабвуфер"
