# language:ru
# encoding: utf-8
Функционал: Животные и растения -> Неконечные рубрики

  Контекст:
    Когда открыта страница для региона "Россия"

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Животные и растения -> Животные"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Животные и растения -> Аксессуары"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Состояние       |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |
