# language:ru
# encoding: utf-8
Функционал: Все для дачи -> Садовые инструменты, инвентарь -> Насосы

  Контекст:
    Когда открыта страница для региона "Казахстан"
        И на главной странице я перехожу в категорию "Все для дачи -> Садовые инструменты, инвентарь -> Насосы"

@all_results
  Сценарий: Все результаты
   Когда на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И сначала отображаются премиум-объявления
       И на странице показано <= 20 объявлений

  Сценарий: Фильтр по типу предложения
   Когда я делаю поиск по следующим параметрам:
      | parameter       | value  |
      | Тип предложения | продам |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Тип предложения" равно "продам"

  Сценарий: Фильтр по состоянию
   Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | Состояние | новый |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Состояние" равно "новый"

  Сценарий: Фильтр по цене
    Когда я делаю поиск по следующим параметрам:
        | parameter      | min  | max    | value |
        | Цена           | 100  | 100000 |       |
        | Валюта         |      |        | тенге  |
       И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении цена >= 100
       И в каждом объявлении цена <= 100000
       И в каждом объявлении валюта равна "тенге"

  Сценарий: Фильтр по валюте
    Когда я делаю поиск по следующим параметрам:
      | parameter      | min  | max    | value |
      | Цена           | 100  | 100000 |       |
      | Валюта         |      |        | $     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении валюта равна "$"
       И в каждом объявлении цена >= 100
       И в каждом объявлении цена <= 100000

@customfield
  Сценарий: Фильтр по типу насоса
   Когда я делаю поиск по следующим параметрам:
      | parameter  | value     |
      | Тип насоса | погружной |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Тип насоса" равно "погружной"

@customfield
  Сценарий: Фильтр по марке и модели
   Когда я делаю поиск по следующим параметрам:
      | parameter | value         |
      | Марка     | ДЖИЛЕКС       |
      | Модель    | Водомет 60/52 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Марка" равно "ДЖИЛЕКС"
       И в деталях первого объявления "Модель" равно "Водомет 60/52"

@customfield
  Сценарий: Фильтр по глубине погружения
    Когда я делаю поиск по следующим параметрам:
      | parameter             | min | max |
      | Глубина погружения, м | 1   | 100 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Глубина погружения, м" >= "1"
       И в деталях первого объявления "Глубина погружения, м" <= "100"

@customfield
  Сценарий: Фильтр по максимальному напору
    Когда я делаю поиск по следующим параметрам:
      | parameter             | min | max |
      | Максимальный напор, м | 1   | 100 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Максимальный напор, м" >= "1"
       И в деталях первого объявления "Максимальный напор, м" <= "100"

@customfield
  Сценарий: Фильтр по потребляемой мощности
    Когда я делаю поиск по следующим параметрам:
      | parameter                 | min | max  |
      | Потребляемая мощность, Вт | 1   | 1000 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Потребляемая мощность, Вт" >= "1"
       И в деталях первого объявления "Потребляемая мощность, Вт" <= "1000"

@customfield
@empty_results
  Сценарий: Фильтр по объему гидробака
    Когда я делаю поиск по следующим параметрам:
      | parameter          | min | max  |
      | Объем гидробака, л | 1   | 1000 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Объем гидробака, л" >= "1"
       И в деталях первого объявления "Объем гидробака, л" <= "1000"

@customfield
  Сценарий: Фильтр по качеству воды
   Когда я делаю поиск по следующим параметрам:
      | parameter     | value  |
      | Качество воды | чистая |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Качество воды" равно "чистая"

@customfield
  Сценарий: Фильтр по пропускной способности
    Когда я делаю поиск по следующим параметрам:
      | parameter                          | min | max  |
      | Пропускная способность, куб. м/час | 1   | 1000 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Пропускная способность, куб. м/час" >= "1"
       И в деталях первого объявления "Пропускная способность, куб. м/час" <= "1000"

@customfield
  Сценарий: Фильтр по длине сетевого шнура
    Когда я делаю поиск по следующим параметрам:
      | parameter               | min | max  |
      | Длина сетевого шнура, м | 1   | 1000 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Длина сетевого шнура, м" >= "1"
       И в деталях первого объявления "Длина сетевого шнура, м" <= "1000"

@customfield
  Сценарий: Фильтр по установке насоса
   Когда я делаю поиск по следующим параметрам:
      | parameter        | value          |
      | Установка насоса | горизонтальная |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Установка насоса" равно "горизонтальная"

@customfield
  Сценарий: Фильтр по защите от перегрева
   Когда я делаю поиск по следующим параметрам:
      | parameter           | value |
      | Защита от перегрева | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления присутствует "Защита от перегрева"

@customfield
  Сценарий: Фильтр по механизму насоса
   Когда я делаю поиск по следующим параметрам:
      | parameter       | value        |
      | Механизм насоса | вибрационный |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Механизм насоса" равно "вибрационный"

@customfield
  Сценарий: Фильтр по глубине до зеркала воды
    Когда я делаю поиск по следующим параметрам:
      | parameter                  | min | max  |
      | Глубина до зеркала воды, м | 1   | 1000 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Глубина до зеркала воды, м" >= "1"
       И в деталях первого объявления "Глубина до зеркала воды, м" <= "1000"

@customfield
  Сценарий: Фильтр по весу
    Когда я делаю поиск по следующим параметрам:
      | parameter | min | max  |
      | Вес, кг   | 1   | 1000 |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Вес, кг" >= "1"
       И в деталях первого объявления "Вес, кг" <= "1000"

  Сценарий: Фильтр по наличию фото
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | С фото    | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении отображается загруженная фотография

@empty_results
  Сценарий: Фильтр по наличию видео
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | С видео   | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления отображается видео

@empty_results
  Сценарий: Фильтр по источнику
    Когда я делаю поиск по следующим параметрам:
      | parameter | value       |
      | Источник  | Сайт IRR.KZ |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении источник равен "Сайт IRR.KZ"

@empty_results
  Сценарий: Фильтр по времени подачи
    Когда я делаю поиск по следующим параметрам:
      | parameter | value    |
      | Поданные  | за месяц |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И каждое объявление подано не более 31 дней назад

@bugs @bug34183
  Сценарий: Фильтр по ключевому слову в заголовке объявления
    Когда я указываю искать только в заголовках объявления
        И я ищу "память"
        И на странице поиска загружен список результатов

       То на странице показано >= 1 объявлений
        И в заголовке каждого объявления содержится "память"

@bugs @bug34183
  Сценарий: Фильтр по ключевому слову
    Когда я ищу "память"
        И на странице поиска загружен список результатов

       То на странице показано >= 1 объявлений
        И в первом объявлении содержится "память"
