# language:ru
# encoding: utf-8
Функционал: Одежда, обувь, аксессуары -> Неконечные рубрики

  Контекст:
    Когда открыта страница для региона "Россия"

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Одежда, обувь, аксессуары -> Украшения, ювелирные изделия, бижутерия"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Одежда, обувь, аксессуары -> Аксессуары"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |

@visible_filter
  Сценарий: Видимые фильтры
       * на главной странице я перехожу в категорию "Одежда, обувь, аксессуары -> Всё для свадьбы"
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
   Когда я раскрываю список фильтров
       * в списке фильтров показаны следующие фильтры:
         | фильтр          |
         | Цена            |
         | Ключевые слова  |
         | С фото          |
         | С видео         |
         | Источник        |
         | Поданные        |
