# language:ru
# encoding: utf-8
@smoketest
Функционал: Главная страница

  Структура сценария: Проверка перехода по категориям в России
      Когда открыта страница для региона "Россия"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Москве
      Когда открыта страница для региона "Москва"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Бийске
      Когда открыта страница для региона "Бийск"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Усть-Алтане
      Когда открыта страница для региона "Усть-Алтан"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Сценарий: Проверка отображения секции "Вы недавно смотрели" для Авто
      Когда открыта страница для региона "Россия"
          * я вхожу под пользователем с ролью "Интернет-партнер"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Авто и мото -> Легковые автомобили"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
          * в деталях объявления я запоминаю фото первого объявления
          * в деталях объявления я запоминаю заголовок первого объявления
          * в деталях объявления я запоминаю цену первого объявления
          * в деталях объявления я запоминаю валюту первого объявления
          * в деталях объявления я запоминаю URL первого объявления

      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 1 объявлений
          * у первого объявления в секции "Вы недавно смотрели" отображено правильное фото
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный заголовок
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная цена
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный URL

  Сценарий: Проверка отображения секции "Вы недавно смотрели" для Недвиги
      Когда открыта страница для региона "Россия"
          * я вхожу под пользователем с ролью "Интернет-партнер"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
          * в деталях объявления я запоминаю фото первого объявления
          * в деталях объявления я запоминаю заголовок первого объявления
          * в деталях объявления я запоминаю цену первого объявления
          * в деталях объявления я запоминаю валюту первого объявления
          * в деталях объявления я запоминаю URL первого объявления

      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 1 объявлений
          * у первого объявления в секции "Вы недавно смотрели" отображено правильное фото
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный заголовок
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная цена
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный URL

  Сценарий: Проверка уникальности элементов в секции "Вы недавно смотрели"
      Когда открыта страница для региона "Россия"
          * я вхожу под пользователем с ролью "Интернет-партнер"
         То на главной странице не показана секция "Вы недавно смотрели"
      # Открываем объявление
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
      # Второй раз открываем то же самое объявление
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления

      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 1 объявлений

  Сценарий: Храним не более 10ти элементов в секции "Вы недавно смотрели"
      Когда открыта страница для региона "Россия"
          * я вхожу под пользователем с ролью "Интернет-партнер"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
          * на странице поиска загружен список результатов
          * на странице показано > 11 объявлений
         # Открываем детали всех объявлений
         То я открываю первые 11 объявлений
      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 10 объявлений

  Сценарий: Отображаем не более 5ти элементов в секции "Вы недавно смотрели"
      Когда открыта страница для региона "Россия"
          * я вхожу под пользователем с ролью "Интернет-партнер"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
          * на странице поиска загружен список результатов
          * на странице показано > 5 объявлений
         # Открываем детали всех объявлений
         То я открываю первые 6 объявлений
      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 6 объявлений
          * в секции "Вы недавно смотрели" отображено 5 объявлений
          * в секции "Вы недавно смотрели" отображена стрелка прокрутки вправо
          * в секции "Вы недавно смотрели" первое объявление отображено
          * в секции "Вы недавно смотрели" последнее объявление спрятано

      Когда в секции "Вы недавно смотрели" я нажимаю на стрелку прокрутки вправо
         То в секции "Вы недавно смотрели" отображено 5 объявлений
          * в секции "Вы недавно смотрели" первое объявление спрятано
          * в секции "Вы недавно смотрели" последнее объявление отображено
          * в секции "Вы недавно смотрели" отображена стрелка прокрутки влево
          * в секции "Вы недавно смотрели" спрятана стрелка прокрутки вправо

      Когда в секции "Вы недавно смотрели" я нажимаю на стрелку прокрутки влево
         То в секции "Вы недавно смотрели" отображено 5 объявлений
          * в секции "Вы недавно смотрели" первое объявление отображено
          * в секции "Вы недавно смотрели" последнее объявление спрятано
          * в секции "Вы недавно смотрели" отображена стрелка прокрутки вправо
          * в секции "Вы недавно смотрели" спрятана стрелка прокрутки влево
