# language:ru
# encoding: utf-8
@smoketest
Функционал: Главная страница

  Структура сценария: Проверка перехода по категориям в России
      Когда открыта страница для региона "Россия"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Москве
      Когда открыта страница для региона "Москва"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Бийске
      Когда открыта страница для региона "Бийск"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Усть-Алтане
      Когда открыта страница для региона "Усть-Алтан"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |
