# language:ru
# encoding: utf-8
@smoketest
Функционал: Главная страница

  Структура сценария: Проверка перехода по категориям в России
      Когда открыта страница для региона "Россия"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Москве
      Когда открыта страница для региона "Москва"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Бийске
      Когда открыта страница для региона "Бийск"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Структура сценария: Проверка перехода по категориям в Усть-Алтане
      Когда открыта страница для региона "Усть-Алтан"
          * на главной странице я перехожу в категорию "<категория>" через меню
         То открытая ссылка соответствует категории

    Примеры:
      | категория                     |
      | Недвижимость                  |
      | Авто и мото                   |
      | Строительство и ремонт        |
      | Бытовая техника и электроника |
      | Компьютерная техника          |
      | Оборудование                  |
      | Телефоны и связь              |
      | Все для дачи                  |
      | Товары для детей              |
      | Фото, оптика                  |
      | Одежда, обувь, аксессуары     |
      | Мебель, интерьер, обиход      |
      | Здоровье и красота            |
      | Праздники и подарки           |
      | Книги, учебники, журналы      |
      | Спорт, туризм, отдых          |
      | Работа и образование          |
      | Знакомства и общение          |
      | Музыка, искусство             |
      | Отдам даром                   |
      | Животные и растения           |
      | Услуги и деятельность         |
      | Бизнес и партнерство          |
      | Другое                        |


      | Недвижимость -> Продажа квартир           |
      | Недвижимость -> Аренда квартир            |
      | Недвижимость -> Дома, дачи, участки       |
      | Недвижимость -> Коммерческая недвижимость |
      | Авто и мото -> Легковые автомобили        |
      | Авто и мото -> Коммерческий транспорт     |
      | Авто и мото -> Мототехника и автодома     |
      | Авто и мото -> Автозапчасти               |
      | Авто и мото -> Автосервис                 |

  Сценарий: Проверка отображения секции "Вы недавно смотрели" для Авто
      Когда открыта страница для региона "Россия"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Авто и мото -> Легковые автомобили"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
          * в деталях объявления я запоминаю фото первого объявления
          * в деталях объявления я запоминаю заголовок первого объявления
          * в деталях объявления я запоминаю цену первого объявления
          * в деталях объявления я запоминаю валюту первого объявления
          * в деталях объявления я запоминаю URL первого объявления

      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 1 объявлений
          * у первого объявления в секции "Вы недавно смотрели" отображено правильное фото
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный заголовок
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная цена
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный URL

  Сценарий: Проверка отображения секции "Вы недавно смотрели" для Недвиги
      Когда открыта страница для региона "Россия"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
          * в деталях объявления я запоминаю фото первого объявления
          * в деталях объявления я запоминаю заголовок первого объявления
          * в деталях объявления я запоминаю цену первого объявления
          * в деталях объявления я запоминаю валюту первого объявления
          * в деталях объявления я запоминаю URL первого объявления

      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 1 объявлений
          * у первого объявления в секции "Вы недавно смотрели" отображено правильное фото
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный заголовок
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная цена
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображена правильная валюта
          * у первого объявления в секции "Вы недавно смотрели" отображен правильный URL

  Сценарий: Проверка уникальности элементов в секции "Вы недавно смотрели"
      Когда открыта страница для региона "Россия"
         То на главной странице не показана секция "Вы недавно смотрели"
      # Открываем объявление
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
      # Второй раз открываем то же самое объявление
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
             | С фото    | x     |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления

      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 1 объявлений

  Сценарий: Храним не более 10ти элементов в секции "Вы недавно смотрели"
      Когда открыта страница для региона "Россия"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
          * на странице поиска загружен список результатов
          * на странице показано >= 11 объявлений
         # Открываем детали всех объявлений
         То я открываю первые 11 объявлений
      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 10 объявлений

  Сценарий: Отображаем не более 5ти элементов в секции "Вы недавно смотрели"
      Когда открыта страница для региона "Россия"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
          * на странице поиска загружен список результатов
          * на странице показано > 5 объявлений
         # Открываем детали всех объявлений
         То я открываю первые 6 объявлений
      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 6 объявлений
          * в секции "Вы недавно смотрели" отображено 5 объявлений
          * в секции "Вы недавно смотрели" отображена стрелка прокрутки вправо
          * в секции "Вы недавно смотрели" первое объявление отображено
          * в секции "Вы недавно смотрели" последнее объявление спрятано

      Когда в секции "Вы недавно смотрели" я нажимаю на стрелку прокрутки вправо
         То в секции "Вы недавно смотрели" отображено 5 объявлений
          * в секции "Вы недавно смотрели" первое объявление спрятано
          * в секции "Вы недавно смотрели" последнее объявление отображено
          * в секции "Вы недавно смотрели" отображена стрелка прокрутки влево
          * в секции "Вы недавно смотрели" спрятана стрелка прокрутки вправо

      Когда в секции "Вы недавно смотрели" я нажимаю на стрелку прокрутки влево
         То в секции "Вы недавно смотрели" отображено 5 объявлений
          * в секции "Вы недавно смотрели" первое объявление отображено
          * в секции "Вы недавно смотрели" последнее объявление спрятано
          * в секции "Вы недавно смотрели" отображена стрелка прокрутки вправо
          * в секции "Вы недавно смотрели" спрятана стрелка прокрутки влево

  Сценарий: Проверка очистки недавно просмотренных объявлений
      Когда открыта страница для региона "Россия"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления

      Когда открыта страница для региона "Россия"
          * в секции "Вы недавно смотрели" показано == 1 объявлений
          * в секции "Вы недавно смотрели" я нажимаю "Очистить"
          * на главной странице не показана секция "Вы недавно смотрели"

      Когда на главной странице я перехожу в категорию "Недвижимость -> Квартиры. Продажа -> Новостройки"
          * я делаю поиск по следующим параметрам:
             | parameter | value |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
      Когда открыта страница для региона "Усть-Алтан"
          * в секции "Вы недавно смотрели" показано == 1 объявлений

  Сценарий: Проверяем отображение состояние и типа предложения
      Когда открыта страница для региона "Россия"
         То на главной странице не показана секция "Вы недавно смотрели"
      Когда на главной странице я перехожу в категорию "Авто и мото -> Коммерческий транспорт -> Спецтехника"
          * я делаю поиск по следующим параметрам:
             | parameter             | value |
             | Новый или подержанный | новый |
          * на странице поиска загружен список результатов
          * на странице показано >= 1 объявлений
         То на странице поиска я открываю детали первого объявления
      Когда открыта страница для региона "Россия"
          * в секции "Вы недавно смотрели" показано == 1 объявлений
          * у первого объявления в секции "Вы недавно смотрели" в деталях записано "Новый, Продам"

  Сценарий: Проверка секции последнего поиска
    Когда открыта страница для региона "Россия"
       То на главной странице не показана секция "Вы искали"
    Когда я ищу "авто"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Россия"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | авто |

  Сценарий: В секции последнего поиска сохраняем не более 5ти результатов
    Когда открыта страница для региона "Россия"
       То на главной странице не показана секция "Вы искали"
    Когда я ищу "авто"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Россия"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | авто |

    Когда я ищу "квартира"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Москва"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | квартира |
          | авто     |

    Когда я ищу "телефон"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Усть-Алтан"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | телефон  |
          | квартира |
          | авто     |

    Когда я ищу "плеер"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Усть-Алтан"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | плеер    |
          | телефон  |
          | квартира |
          | авто     |

    Когда я ищу "ноутбук"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Усть-Алтан"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | ноутбук  |
          | плеер    |
          | телефон  |
          | квартира |
          | авто     |

    Когда я ищу "планшет"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Усть-Алтан"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | планшет  |
          | ноутбук  |
          | плеер    |
          | телефон  |
          | квартира |

  Сценарий: Проверка очистки запросов в секции "Вы искали"
    Когда открыта страница для региона "Россия"
       То на главной странице не показана секция "Вы искали"
    Когда я ищу "авто"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Россия"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | авто |

    Когда я очищаю запросы в секции "Вы искали"
       То на главной странице не показана секция "Вы искали"

    Когда я ищу "авто"
       То на странице поиска загружен список результатов
    Когда открыта страница для региона "Россия"
       То в секции "Вы искали" указаны следующие поисковые запросы:
          | авто           |



  Структура сценария: Проверяем счетчик объявлений в России
    Когда открыта страница для региона "<регион>"
        * я запоминаю значение счетчика объявления на главной странице
    Когда я перехожу на страницу поиска для этого региона
       То на странице результатов количество результатов равно значению счетчика на главной странице

    Примеры:
        | регион     |
        | Россия     |
        | Москва     |
        | Бийск      |
        | Усть-Алтан |


  Сценарий: Проверка популярных городов в окне выбора регионов
    Когда открыта страница для региона "Россия"
        * я открываю окно выбора региона
        * в окне выбора региона в секции 1 я выбираю "Популярные города"
       То в окне выбора региона секция 3 не показана
        * в окне выбора региона в секции 2 показаны следующие регионы:
           | Москва и область          |
           | Санкт-Петербург и область |
           | Екатеринбург              |
           | Казань                    |
           | Краснодар                 |
           | Набережные челны          |
           | Нижний Новгород           |
           | Пермь                     |
           | Самара                    |
           | Тверь                     |
           | Тольятти                  |
           | Уфа                       |
        * в окне выбора региона выбрано "Москва и область"

  Сценарий: Проверка отображения городов при выборе региона в окне выбора регионов
    Когда открыта страница для региона "Россия"
        * я открываю окно выбора региона
        * в окне выбора региона в секции 1 я выбираю "Россия"
        * в окне выбора региона в секции 2 я выбираю "Москва"
       То в окне выбора региона секция 3 показана
        * в окне выбора региона в секции 3 показаны следующие регионы:
           | Москва     |
           | Зеленоград |
        * в окне выбора региона выбрано "Москва"

  Сценарий: Проверка смены значений в секции городов при выборе региона без городов
    Когда открыта страница для региона "Россия"
        * я открываю окно выбора региона
        * в окне выбора региона в секции 1 я выбираю "Россия"
        * в окне выбора региона в секции 2 я выбираю "Адыгея Респ"
       То в окне выбора региона секция 3 показана
        * в окне выбора региона в секции 3 показаны следующие регионы:
         | Адыгея Респ |
         | Адыгейск    |
         | Майкоп      |
   Когда в окне выбора региона в секции 2 я выбираю "Алтай Респ"
      То в окне выбора региона секция 3 показана
       * в окне выбора региона в секции 3 показаны следующие регионы:
         | Алтай Респ    |
         | Горно-Алтайск |

  Сценарий: Проверка исчезновения секции городов при выборе региона без городов
    Когда открыта страница для региона "Россия"
        * я открываю окно выбора региона
        * в окне выбора региона в секции 1 я выбираю "Россия"
        * в окне выбора региона в секции 2 я выбираю "Адыгея Респ"
       То в окне выбора региона секция 3 показана
        * в окне выбора региона в секции 3 показаны следующие регионы:
         | Адыгея Респ |
         | Адыгейск    |
         | Майкоп      |
   Когда в окне выбора региона в секции 2 я выбираю "Вся Россия"
      То в окне выбора региона секция 3 не показана
       * в окне выбора региона выбрано "Вся Россия"

  Сценарий: Проверка исчезновения секции городов при выборе региона без городов
    Когда открыта страница для региона "Россия"
        * я открываю окно выбора региона
        * в окне выбора региона в секции 1 я выбираю "Россия"
        * в окне выбора региона в секции 2 я выбираю "Адыгея Респ"
       То в окне выбора региона секция 3 показана
        * в окне выбора региона в секции 3 показаны следующие регионы:
         | Адыгея Респ |
         | Адыгейск    |
         | Майкоп      |
   Когда в окне выбора региона в секции 1 я выбираю "Россия"
      То в окне выбора региона секция 3 не показана
       * в окне выбора региона выбрано "Вся Россия"
