# language:ru
# encoding: utf-8
Функционал: Работа и образование -> Вакансии: поиск сотрудников -> Страхование

  Контекст:
    Когда открыта страница для региона "Россия"
        И на главной странице я перехожу в категорию "Работа и образование -> Вакансии: поиск сотрудников -> Страхование"

@all_results
  Сценарий: Все результаты
   Когда на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И сначала отображаются премиум-объявления
       И на странице показано <= 20 объявлений

  Сценарий: Фильтр по специализации
   Когда я делаю поиск по следующим параметрам:
      | parameter          | value  |
      | Специализация      | дизайн |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Специализация" равно "дизайн"

  Сценарий: Фильтр по зарплате
    Когда я делаю поиск по следующим параметрам:
        | parameter | min | value |
        | Зарплата  | 100 |       |
        | Валюта    |     | руб.  |
       И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении зарплата >= 100
       И в каждом объявлении валюта равна "руб."

  Сценарий: Фильтр по валюте
    Когда я делаю поиск по следующим параметрам:
        | parameter | min | value |
        | Зарплата  | 100 |       |
        | Валюта    |     | $     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении зарплата >= 100
       И в каждом объявлении валюта равна "$"

  Сценарий: Фильтр по режиму работы
   Когда я делаю поиск по следующим параметрам:
      | parameter    | value       |
      | Режим работы | полный день |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Режим работы" равно "полный день"

  Сценарий: Фильтр по типу занятости
   Когда я делаю поиск по следующим параметрам:
      | parameter     | value      |
      | Тип занятости | постоянная |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления "Тип занятости" равно "постоянная"

  Сценарий: Фильтр по наличию фото
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | С фото    | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении отображается загруженная фотография

@empty_results
  Сценарий: Фильтр по наличию видео
    Когда я делаю поиск по следующим параметрам:
      | parameter | value |
      | С видео   | x     |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в деталях первого объявления отображается видео

@empty_results
  Сценарий: Фильтр по источнику
    Когда я делаю поиск по следующим параметрам:
      | parameter | value       |
      | Источник  | Cайт IRR.RU |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И в каждом объявлении источник равен "Сайт IRR.RU"

@empty_results
  Сценарий: Фильтр по времени подачи
    Когда я делаю поиск по следующим параметрам:
      | parameter | value    |
      | Поданные  | за месяц |
      И на странице поиска загружен список результатов

      То на странице показано >= 1 объявлений
       И каждое объявление подано не более 31 дней назад

@bugs @bug34183
  Сценарий: Фильтр по ключевому слову в заголовке объявления
    Когда я указываю искать только в заголовках объявления
        И я ищу "память"
        И на странице поиска загружен список результатов

       То на странице показано >= 1 объявлений
        И в заголовке каждого объявления содержится "память"

@bugs @bug34183
  Сценарий: Фильтр по ключевому слову
    Когда я ищу "память"
        И на странице поиска загружен список результатов

       То на странице показано >= 1 объявлений
        И в первом объявлении содержится "память"


