# language:ru
# encoding: utf-8
Функционал: Авто и мото -> Мототехника и автодома - seo-линки

  Контекст:
    Когда открыта страница для города "Москва"
        И на главной странице я перехожу в категорию "Авто и мото -> Мототехника и автодома"

  Сценарий: Фильтр по скутерам
    Когда я выбираю ссылку "Скутеры" в секции "Быстрый поиск"
       То ссылка содержит "scooter"

  Сценарий: Фильтр по квадроциклам
    Когда я выбираю ссылку "Квадроциклы" в секции "Быстрый поиск"
       То ссылка содержит "quad"

  Сценарий: Фильтр по мопедам
    Когда я выбираю ссылку "Мопеды" в секции "Быстрый поиск"
       То ссылка содержит "moped"
